const EN_BTNS = ['`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', '\\', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', "'", 'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/'];
const EN_SHIFT_BTNS = ['~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '+', 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', '|', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?'];
const RU_BTNS = ['ё', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', '\\', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.'];
const RU_SHIFT_BTNS = ['Ё', '!', '"', '№', ';', '%', ':', '?', '*', '(', ')', '_', '+', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', '/', 'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', ','];

const i18Obj = {
  en: {},
  enShift: {},
  ru: {},
  ruShift: {},
};
for (let i = 0; i < EN_BTNS.length; i += 1) {
  const ENG_VAL = i18Obj.en;
  ENG_VAL[`${EN_BTNS[i]}`] = EN_BTNS[i];
  const ENG_SHIFT_VAL = i18Obj.enShift;
  ENG_SHIFT_VAL[`${EN_BTNS[i]}`] = EN_SHIFT_BTNS[i];
  const RU_VAL = i18Obj.ru;
  RU_VAL[`${EN_BTNS[i]}`] = RU_BTNS[i];
  const RU_SHIFT_VAL = i18Obj.ruShift;
  RU_SHIFT_VAL[`${EN_BTNS[i]}`] = RU_SHIFT_BTNS[i];
}
export default i18Obj;
